# Работа с БД SQLite

In [49]:
import sqlite3
from prettytable import from_db_cursor

In [50]:
import os

# Временный каталог
TEMP_DIR = "temp"

if not os.path.exists(TEMP_DIR):
    os.mkdir(TEMP_DIR)

# Пример использования
os.path.join(TEMP_DIR, "temp_SQLite.db")

'temp\\temp_SQLite.db'

In [51]:
#db_name = os.path.join(TEMP_DIR, 'temp_SQLite.db')
db_name = ":memory:"

if os.path.isfile(db_name):
    os.remove(db_name)
    print(f"Файл [{db_name}] - удален")

In [52]:
db = sqlite3.connect(db_name)
cur = db.cursor()

In [53]:
#cur.execute("CREATE TABLE cities (name)")
#cur.execute("CREATE TABLE cities (name varchar(100))")
cur.execute("CREATE TABLE cities (id integer primary key AUTOINCREMENT NOT NULL, name varchar(100) unique)")
db.commit()

In [54]:
cur.execute("SELECT * FROM cities")
from_db_cursor(cur)

+----+------+
| id | name |
+----+------+
+----+------+

In [55]:
cur.execute("PRAGMA table_info('cities')")
from_db_cursor(cur)

+-----+------+--------------+---------+------------+----+
| cid | name |     type     | notnull | dflt_value | pk |
+-----+------+--------------+---------+------------+----+
|  0  |  id  |   INTEGER    |    1    |    None    | 1  |
|  1  | name | varchar(100) |    0    |    None    | 0  |
+-----+------+--------------+---------+------------+----+

In [56]:
cur.execute("PRAGMA table_info('cities')")
t = from_db_cursor(cur)
print(t)

+-----+------+--------------+---------+------------+----+
| cid | name |     type     | notnull | dflt_value | pk |
+-----+------+--------------+---------+------------+----+
|  0  |  id  |   INTEGER    |    1    |    None    | 1  |
|  1  | name | varchar(100) |    0    |    None    | 0  |
+-----+------+--------------+---------+------------+----+

In [57]:
cities = "Москва, Воронеж, Калуга, Тула".split(', ')
cities

['Москва', 'Воронеж', 'Калуга', 'Тула']

In [58]:
cities_data = [(i,) for i in cities]
cities_data

[('Москва',), ('Воронеж',), ('Калуга',), ('Тула',)]

In [59]:
cur.execute("INSERT INTO cities (name) VALUES ('Ялта')")

In [60]:
cur.execute("SELECT * FROM cities")
from_db_cursor(cur)

+----+------+
| id | name |
+----+------+
| 1  | Ялта |
+----+------+

In [62]:
cur.executemany("INSERT INTO cities (name) VALUES (?)", [(i,) for i in cities])

cur.execute("SELECT * FROM cities")
from_db_cursor(cur)

+----+---------+
| id |   name  |
+----+---------+
| 1  |   Ялта  |
| 2  |  Москва |
| 3  | Воронеж |
| 4  |  Калуга |
| 5  |   Тула  |
+----+---------+

In [63]:
cur.execute("SELECT * FROM cities")
print(*cur)

(1, 'Ялта') (2, 'Москва') (3, 'Воронеж') (4, 'Калуга') (5, 'Тула')

In [64]:
for line in cur.execute("SELECT * FROM cities"):
    print(line)

(1, 'Ялта')
(2, 'Москва')
(3, 'Воронеж')
(4, 'Калуга')
(5, 'Тула')

In [65]:
# стиль именованный - использование одного или нескольких ":<название>"
sql = "INSERT INTO cities (name) VALUES (:city)"

cur.execute(sql, {"city": "Belgrade"})

cur.execute("SELECT * FROM cities")
from_db_cursor(cur)

+----+----------+
| id |   name   |
+----+----------+
| 1  |   Ялта   |
| 2  |  Москва  |
| 3  | Воронеж  |
| 4  |  Калуга  |
| 5  |   Тула   |
| 6  | Belgrade |
+----+----------+

In [67]:
sql = "DELETE FROM cities WHERE id = ?"

cur.execute(sql, [6])

from_db_cursor(cur.execute("SELECT * FROM cities"))

+----+---------+
| id |   name  |
+----+---------+
| 1  |   Ялта  |
| 2  |  Москва |
| 3  | Воронеж |
| 4  |  Калуга |
| 5  |   Тула  |
+----+---------+

In [ ]:
db.close